bottomSymmetryPlane/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
	(0.000 0.750 0.000) // Vertex 0
	(0.000 12.00 0.000) // Vertex 1
	(1.000 12.00 0.000) // Vertex 2
	(35.00 12.00 0.000) // Vertex 3
	(35.00 0.750 0.000) // Vertex 4
	(35.00 0.000 0.000) // Vertex 5
	(1.000 0.000 0.000) // Vertex 6
	(1.000 0.750 0.000) // Vertex 7
	(0.000 0.750 0.500) // Vertex 8
	(0.000 12.00 0.500) // Vertex 9
	(1.000 12.00 0.500) // Vertex 10
	(35.00 12.00 0.500) // Vertex 11
	(35.00 0.750 0.500) // Vertex 12
	(35.00 0.000 0.500) // Vertex 13
	(1.000 0.000 0.500) // Vertex 14
	(1.000 0.750 0.500) // Vertex 15

	
); 

blocks
(
	hex (0  8 15 7 1  9 10 2) (1  40 100) simpleGrading (1 1 1) // Block 0
	hex (7 15 12 4 2 10 11 3) (1 200 100) simpleGrading (1 1 1) // Block 1
	hex (6 14 13 5 7 15 12 4) (1 200  20) simpleGrading (1 1 1) // Block 2

);

edges
(
);

boundary
(

	capsuleWall
	{
		type wall;
		faces
		(
			(14 6 7 15)
		);
	}

	left
	{
		type wall;
		faces
		(
			(0 8 9 1)
		);
	}
	
	right
	{
		type wall;
		faces
		(
			(13 5 4 12)
			(12 4 3 11)
		);
	}
	
	
	top
	{
		type wall;
		faces
		(
			//Faces in top
			( 9 10 2 1)
			(10 11 3 2)		
		);
	}	
	
		bottom
	{
		type wall;
		faces
		(
			//Faces in bottom
			(0 7 15  8)			
			(6 5 13 14)
		);
	}	
	
	frontAndBack
	{
		type empty;
		faces
		(
			//Faces in back			
			(7 0 1 2)
			(4 7 2 3)
			(5 6 7 4)
			
			
			//Faces in front
			( 8 15 10  9)
			(15 12 11 10)
			(14 13 12 15)

		);
	}

  
);

mergePatchPairs
(
);

// ************************************************************************* //
