bottomSymmetryPlane/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    capsuleWall
    {
        type            wall;
        nFaces          20;
        startFace       55640;
    }
    left
    {
        type            wall;
        nFaces          100;
        startFace       55660;
    }
    right
    {
        type            wall;
        nFaces          120;
        startFace       55760;
    }
    top
    {
        type            wall;
        nFaces          240;
        startFace       55880;
    }
    bottom
    {
        type            wall;
        nFaces          240;
        startFace       56120;
    }
    frontAndBack
    {
        type            empty;
        nFaces          56000;
        startFace       56360;
    }
)

// ************************************************************************* //
